Repository: FlowPorousMedia/MSHF.Productivity
Catalog: src/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Preparing for calculation...
ru: Подготовка к расчету...

source: Default Parameters Notification
ru: Уведомление о параметрах по умолчанию

source: You are about to run the calculation with default parameters. Continue?
ru: Вы собираетесь запустить расчет с параметрами по умолчанию. Продолжить?

source: Yes
ru: Да

source: No
ru: Нет

source: No confirmation needed, starting calculation
ru: Подтверждение не требуется, запуск расчета...

source: Starting calculation...
ru: Расчет начинается...

source: Calculation cancelled
ru: Расчет отменён

source: Checking selected models...
ru: Проверка выбранных моделей...

source: No models selected
ru: Не выбраны модели

source: Please select at least one model before starting the calculation.
ru: Пожалуйста, выберите хотя бы одну модель перед запуском расчета.

source: Warning: no models selected
ru: Внимание: модели не выбраны

source: Configuring calculation parameters...
ru: Настройка параметров расчета...

source: Invalid parametric settings
ru: Некорректные параметрические настройки

source: Error: invalid calculation parameters
ru: Ошибка: неверные параметры расчета

source: Invalid parametric range
ru: Неверный диапазон параметров

source: Error: invalid parameter range
ru: Ошибка: неверный диапазон параметров

source: Preparing data for calculation...
ru: Подготовка данных для расчета...

source: Reading initial data...
ru: Чтение исходных данных...

source: Init data error: {message}
ru: Ошибка в исходных данных: {message}

source: Data preparation error: {message}
ru: Ошибка подготовки данных: {message}

source: Performing calculation...
ru: Расчет...

source: Finalizing calculation...
ru: Расчет завершается...

source: Calculation completed successfully
ru: Расчет успешно завершен

source: Missing Data
ru: Отсутствуют данные

source: Fracture or reservoir data is missing
ru: Отсутствуют данные по пласту или трещинам ГРП

source: Reservoir permeability must be > 0
ru: Значение проницаемости пласта должно быть > 0

source: Invalid Reservoir Data
ru: Некорректные данные по пласту

source: Reservoir permeability is missing or invalid
ru: Значение проницаемости пласта не задано или некорректное

source: Invalid Fracture Data
ru: Некорректные данные по трещинам

source: Fracture {frac_id} length is negative
ru: Длина трещины {frac_id} отрицательна

source: Fracture {frac_id} width is negative
ru: Ширина трещины {frac_id} отрицательна

source: Fracture {frac_id} permeability is negative
ru: Проницаемость трещины {frac_id} отрицательна

source: Fracture {frac_id} {message} is incorrect
ru: Параметр '{message}' в трещине {frac_id} некорректен

source: Fracture {frac_id}: Fcd = {fcd_val}
ru: Трещина {frac_id}: Fcd = {fcd_val}

source: Dimensionless Fracture Conductivity (Fcd)
ru: Безразмерная проводимость трещины (Fcd)

source: Close
ru: Закрыть

source: Invalid result format
ru: Некорректный формат результатов

source: Unsupported result type: {result_type_value}
ru: Неподдерживаемый тип результатов: {result_type_value}

source: Model {index}
ru: Модель {index}

source: Flow Rate Comparison
ru: Сравнение дебитов

source: Models
ru: Модели

source: Q, m³/day
ru: Q, м³/сут

source: Flow Rate Plot
ru: График дебитов

source: Parametric Results Plot
ru: График результатов

source: No data available for parametric visualization
ru: Нет данных для отображения

source: Parameter
ru: Параметр

source: Unnamed Model
ru: Модель без названия

source: No valid data available for parametric visualization
ru: Нет корректных данных для отображения

source: Parametric Analysis
ru: Параметрический расчет

source: Map Results
ru: Результаты на карте

source: Map visualization is under development and will be available in a future release
ru: Визуализация карт находится в разработке и будет доступна в будущих версиях

source: Results Graph
ru: Графики

source: No data available for visualization
ru: Нет данных для отображения

source: Error: {message}
ru: Ошибка: {message}

source: No logs yet
ru: Логи отсутствуют

source: No logs match the filters
ru: Нет записей, соответствующих выбранным фильтрам

source: Showing 0 messages
ru: Показано 0 сообщений

source: Showing {filtered} of {logs} messages
ru: Показано {filtered} из {logs} сообщений

source: Language
ru: Язык

source: Guide
ru: Руководство

source: About
ru: О программе

source: No results available
ru: Результаты отсутствуют

source: Flow Rate Table
ru: Таблица дебитов

source: Parametric Results Table
ru: Таблица параметрических результатов

source: No parametric data available for display
ru: Нет параметрических данных для отображения

source: Download CSV
ru: Скачать CSV

source: Map results display is under development
ru: Отображение результатов на карте находится в разработке

source: Results
ru: Результаты

source: Result type '{result_type}' is not supported
ru: Тип результата '{result_type}' не поддерживается

source: is a powerful Productivity Evaluation Tool for Multistage Fractured Horizontal Wells (MSHF)
ru: — это мощный инструмент для оценки продуктивности горизонтальных скважин с многозонным гидроразрывом пласта (МГРП)

source: This software tool enables petroleum engineers to rapidly forecast production rates for multistage fractured horizontal wells. It utilizes analytical modeling to perform steady-state flow analysis, providing a quick and efficient solution for well performance evaluation.
ru: Программа предоставляет инженерам-нефтяникам удобный инструмент для быстрой оценки дебита скважин с МГРП при стационарной фильтрации с помощью аналитических моделей.

source: Authors
ru: Авторы

source: Marsel Khamidullin
ru: Марсель Хамидуллин

source: Constantin Potashev
ru: Константин Поташев

source: License
ru: Лицензия

source: All rights reserved
ru: Все права защищены

source: This project is distributed under the
ru: Данный проект распространяется на условиях лицензии

source: Support
ru: Поддержка

source: For support, please open an issue on
ru: Для получения поддержки откройте обращение в

source: Viscosity, (cP):
ru: Вязкость (сП):

source: Fractures count:
ru: Количество трещин:

source: Fract
ru: Трещина

source: Show Fcd
ru: Показать Fcd

source: Show Fcd values
ru: Показать значения Fcd

source: Log Viewer
ru: Журнал сообщений

source: Show logs for:
ru: Показывать в журнале логи по типу:

source: Show only calculation logs
ru: Показывать только логи расчета

source: Show system logs
ru: Показывать системные логи

source: Search:
ru: Поиск:

source: Search in logs...
ru: Введите текст для поиска по журналу

source: Save
ru: Сохранить

source: Clear
ru: Очистить

source: Fracture Analysis Dashboard
ru: Панель анализа ГС и трещин

source: Run calculation
ru: Рассчитать

source: Show logs
ru: Показать журнал

source: Model Details
ru: Описание модели

source: Parametric Plot
ru: Параметрический график

source: Start
ru: Начало

source: End
ru: Конец

source: Point Count
ru: Количество точек

source: Radius, (m):
ru: Радиус пласта (м):

source: Height, (m):
ru: Высота пласта (м):

source: Permeability, (D):
ru: Проницаемость (Д):

source: Pressure, (atm):
ru: Давление (атм):

source: Parameters
ru: Параметры

source: Collapse/Expand sidebar
ru: Скрыть/Показать боковую панель

source: Fracture Parameters
ru: Трещины

source: Well Parameters
ru: Скважина

source: Reservoir Parameters
ru: Пласт

source: Fluid Properties
ru: Флюид

source: Input Data
ru: Входные данные

source: Analytical
ru: Аналитические

source: Semi-analytical
ru: Полу-аналитические

source: Parametric Calc Settings
ru: Параметрический расчет

source: Settings
ru: Настройки

source: Ready for calculation
ru: Готово к расчету

source: Scheme MSHFHW
ru: Схема ГС с МГРП

source: A practical method to predict performance of a horizontal well which is hydraulically fractured and partially perforated has been proposed in this paper. Using the mathematical model presented in this paper, factors affecting performance of a hydraulically fractured horizontal well have been analyzed
ru: Предложен практический метод расчёта продуктивности горизонтальной скважины с гидроразрывом пласта и частичной перфорацией. На основе представленной математической модели выполнён анализ факторов, влияющих на продуктивность такой скважины.

source: Prediction of performance for hydraulically fractured horizontal wells
ru: Прогноз продуктивности горизонтальных скважин с гидроразрывом пласта

source: Wells with partial perforation
ru: Скважины с частичной перфорацией

source: Fracture half-length is equal in both directions from the wellbore
ru: Полудлина трещины одинакова в обе стороны от ствола скважины

source: Fracture height is equal to the reservoir height
ru: Высота трещины равна мощности пласта

source: This paper presents a simple and more rigorous mathematical model for predicting performance of vertical and horizontal wells intersecting fractures fully penetrating reservoir sections. An important feature of the new model is that it allows rigorous coupling of flow in the matrix and flow in the fracture
ru: В статье представлена простая и строгая математическая модель для оценки продуктивности вертикальных и горизонтальных скважин, пересекающих трещины, полностью проходящие пласт. Модель обеспечивает строгую связь течения в матрице и в трещине.

source: Well perforation does not take into account
ru: Перфорация скважины не учитывается

source: Formulated a simple analytical model that describes the productivity of multifractured horizontal wells better. The new model couples the radial flow in the nonfractured region of reservoir, the linear flow toward the fractures in the fractured region, the linear flow in the fracture, and the radial flow in the fracture toward the horizontal wellbore. It can model pseudosteady-state flow of reservoir fluids in reservoir sections of any shape, with the fractured region being located at any area in the reservoir
ru: Предложена простая аналитическая модель, более точно описывающая продуктивность многотрещинных горизонтальных скважин. Модель учитывает радиальное и линейное течение как в матрице, так и в трещинах, включая радиальное течение в трещине к горизонтальному стволу. Подходит для псевдоустановившегося режима в резервуарах любой формы.

source: Show model details
ru: Детали модели

source: The scope of the work is to develop high-speed and fairly accurate methods for calculating the productivity of wells with multi-stage hydraulic fracturing
ru: Цель работы — разработка быстрых и достаточно точных методов оценки продуктивности скважин с многостадийным гидроразрывом пласта.

source: Infinite conductivity fractures
ru: Трещины с бесконечной проводимостью

source: [{label}] ❌ Key '{key}' is not in dictionry
ru: [{label}] ❌ Ключ '{key}' отсутствует в словаре

source: [{label}] ❌ Key mismatch '{key}': default={val!r} ({type(val).__name__}), user={val2!r} ({type(val2).__name__})
ru: [{label}] ❌ Несовпадение ключа '{key}': по умолчанию={val!r} ({type(val).__name__}), пользователь={val2!r} ({type(val2).__name__})

source: Invalid fracture data
ru: Некорректные данные по трещине

source: Please, set correct value for fracture {index}: {message}
ru: Пожалуйста, задайте корректное значение для трещины {index}: {message}

source: Message
ru: Сообщение

source: Default
ru: По умолчанию

source: Copy to clipboard
ru: Скопировать в буфер обмена

source: Copied!
ru: Скопировано!

source: Citation
ru: Цитирование

source: Abstract
ru: Аннотация

source: Model specification
ru: Детали модели

source: Application
ru: Применение

source: Limitations
ru: Ограничения

source: Source
ru: Источник

source: Results Plot
ru: Графики

source: Press "Calculate" to see visual results here
ru: Нажмите «Рассчитать», чтобы увидеть результаты расчета

source: Results Table
ru: Таблица

source: Press "Calculate" to see table results here
ru: Нажмите «Рассчитать», чтобы увидеть результаты расчета

source: Calculation in progress...
ru: Переход к расчету...

source: DEBUG
ru: ОТЛАДОЧНОЕ

source: INFO
ru: ИНФОРМАЦИЯ

source: WARNING
ru: ПРЕДУПРЕЖДЕНИЕ

source: ERROR
ru: ОШИБКА

source: CRITICAL
ru: КРИТИЧЕСКОЕ

source: Fract count
ru: Количество трещин

source: Fract length, (m)
ru: Длина трещины, (м)

source: Fract perm, (D)
ru: Проницаемость трещины, (Д)

source: Fract width, (mm)
ru: Ширина трещины, (мм)

source: Reservoir radius, (m)
ru: Радиус контура питания, (м)

source: Reservoir height, (m)
ru: Высота пласта, (м)

source: Well length, (m)
ru: Длина ГС, (м)

source: Fracture permeability ({fract_perm} D) is less than reservoir permeability ({reservoir_perm} D)
ru: Проницаемость трещины ({fract_perm} Д) меньше проницаемости пласта ({reservoir_perm} Д)

source: Elkin (2016)
ru: Ёлкин (2016)

source: Well Length is required
ru: Необходимо указать длину скважины

source: Well Length should be positive number
ru: Длина скважины должна быть положительным числом

source: Length Plus, (m)
ru: Длина + (м)

source: Length Minus, (m)
ru: Длина - (м)

source: Width, (mm)
ru: Ширина (мм)

source: Permeability, (D)
ru: Проницаемость (Д)

source: Well cross depth, (m)
ru: Глубина пересечения с ГС (м)

source: Length, (m)
ru: Длина (м)

source: Radius, (cm)
ru: Радиус (см)

source: Pressure, (atm)
ru: Давление (атм)

source: Perforated
ru: Перфорирована

source: {field_name} should be at least {min_val}{str_descrp}
ru: {field_name} должно быть не меньше {min_val}{str_descrp}

source: {field_name} should be greater than {min_val}{str_descrp}
ru: {field_name} должно быть больше {min_val}{str_descrp}

source: {field_name} should be at most {max_val}{str_descrp}
ru: {field_name} должно быть не больше {max_val}{str_descrp}

source: {field_name} should be less than {max_val}{str_descrp}
ru: {field_name} должно быть меньше {max_val}{str_descrp}

source: Fract Index '{fract_index}' is out of bounds [1, {n}]
ru: Индекс трещины '{fract_index}' выходит за пределы [1, {n}]

source: Model {model_name}: point {point_index}/{point_count}
ru: Модель {model_name}: точка {point_index}/{point_count}

source: {model_name} calculated in {calc_time:.2f} sec
ru: {model_name} рассчитана за {calc_time:.2f} с

source: Parametric calculation completed
ru: Параметрический расчет завершён

source: calc model rate with unknown model type
ru: расчет модели с неизвестным типом

source: Invalid parameter for parametric calculation
ru: Некорректный параметр для параметрического расчета

source: {model_name} can not be calculated for R < {rc:.1f}
ru: {model_name} не может быть рассчитана при R < {rc:.1f}
